{"class_name": "Functional", "config": {"name": "model_29", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_30"}, "name": "input_30", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_29", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 40, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_29", "inbound_nodes": [[["input_30", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_29", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_29", "inbound_nodes": [[["embedding_29", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_29", "inbound_nodes": [[["lstm_29", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["dropout_29", 0, 0, {}]]]}], "input_layers": [["input_30", 0, 0]], "output_layers": [["dense_29", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}